Repository: Luc4st1574/Harkai-AI-Security-Experience-Mobile-Flutter-App
Catalog: lib/l10n/app_*.arb
Languages: es

# notifTheftAlertTitle
source: Theft Alert
es: Alerta de Robo

# notifTheftAlertBody
source: A theft has been reported nearby. Please be aware of your surroundings.
es: Se ha reportado un robo cerca. Por favor, mantente alerta.

# notifTheftSecurityTitle
source: Security Alert
es: Alerta de Seguridad

# notifTheftSecurityBody
source: You are very close to a reported theft. Avoid the area and stay safe.
es: Estás muy cerca de un robo reportado. Evita la zona y mantente a salvo.

# notifGenericIncidentTitle
source: Incident Nearby
es: Incidente Cercano

# notifGenericIncidentBody
source: Take a look around and see if you can help.
es: Echa un vistazo y ve si puedes ayudar.

# notifPlaceDiscoveryTitle
source: Discover a New Place
es: Descubre un Nuevo Lugar

# notifPlaceDiscoveryBody
source: Hey, you are near {placeName}! We think you should check it out.
es: ¡Oye, estás cerca de {placeName}! Creemos que deberías echarle un vistazo.

# notifPlaceAlmostThereTitle
source: You're Almost There!
es: ¡Ya Casi Llegas!

# notifPlaceAlmostThereBody
source: You're getting closer to {placeName}. Enjoy your visit!
es: Te estás acercando a {placeName}. ¡Disfruta tu visita!

# notifPlaceWelcomeTitle
source: Welcome!
es: ¡Bienvenido!

# notifPlaceWelcomeBody
source: We are glad you came to {placeName}. We hope you enjoy your time here!
es: Nos alegra que hayas venido a {placeName}. ¡Esperamos que disfrutes tu estancia aquí!

# incidentModalReportTextTitle
source: Report with Text for {incidentName}
es: Dinos lo que paso {incidentName}

# incidentModalInstructionEnterText
source: Please describe the incident in the text box below.
es: Por favor, describe el incidente en el cuadro de texto a continuación.

# incidentModalButtonSendTextToHarki
source: Send Text to Harki
es: Enviar Texto a Harki

# incidentModalButtonEnterTextInstead
source: Enter Text Instead
es: Ingresar Texto en su Lugar

# onboardingLocationTitle
source: Always-On Location
es: Ubicación Siempre Activa

# onboardingLocationDescription
source: To keep you safe and provide real-time alerts about nearby incidents even when the app is in the background, Harkai needs to access your location at all times. Please grant this permission on applications settings.
es: Para mantenerte seguro y enviarte alertas en tiempo real sobre incidentes cercanos incluso cuando la aplicación está en segundo plano, Harkai necesita acceder a tu ubicación en todo momento. Por favor, concede este permiso en la configuración interna de la app en los ajustes de aplicaciones.

# addplaceTitle
source: Add a Place to Harkai Map
es: Añadir Lugar al Mapa de Harkai

# incidentModalButtonAddFromGallery
source: Add from Gallery
es: Añadir desde Galería

# addplaceInfo
source: To add a new place, please complete the payment below.
es: Para añadir un lugar, completa el pago con el boton de pago

# donationSectionTitle
source: Support Harkai
es: Apoya a Harkai

# donationAmountHint
source: Enter donation amount
es: Ingrese el monto a donar

# donationButtonText
source: Donate
es: Donar

# donationDialogTitle
source: Confirm Donation
es: Confirmar Donación

# donationDialogContent
source: You are about to donate ${amount} to Harkai. Thank you for your support!
es: Estás a punto de donar S/.{amount} a Harkai. ¡Gracias por tu apoyo!

# donationSuccessMessage
source: Thank you for your generous donation!
es: ¡Gracias por tu generosa donación!

# donationFailedMessage
source: Donation cancelled or failed.
es: Donación cancelada o fallida.

# donationInvalidAmountMessage
source: Please enter a valid donation amount.
es: Por favor, ingrese un monto de donación válido.

# donationLabel
source: Donation to Harkai
es: Donación para Harkai

# nearbyVetsTitle
source: Nearby Vets
es: Veterinarias Cercanas

# noNearbyVetsFound
source: No nearby vets registered as places were found in the area.
es: No se encontraron veterinarias cercanas.

# exitScreenButton
source: Exit
es: Salir

# onboardingAlwaysOnLocationPromptTitle
source: Keep You Safe Always
es: Para tu seguridad en todo momento

# onboardingAlwaysOnLocationPromptDescription
source: To keep you safe and provide real-time alerts about nearby incidents even when the app is in the background, Harkai needs to access your location at all times. Please grant this permission when prompted.
es: Para mantenerte seguro y proporcionarte alertas en tiempo real sobre incidentes cercanos, incluso cuando la aplicación está en segundo plano, Harkai necesita acceder a tu ubicación en todo momento. Por favor, concede este permiso cuando se te solicite.

# onboardingAlwaysOnLocationPromptButton
source: Accept & Continue
es: Aceptar y Continuar
