Repository: Luc4st1574/Harkai-AI-Security-Experience-Mobile-Flutter-App
Catalog: lib/l10n/app_*.arb
Languages: es

source: Hello World!
es: ¡Hola Mundo!

# welcomeMessage
source: Welcome, {name}!
es: ¡Bienvenido, {name}!

# firebaseInitError
source: Failed to initialize Firebase. Please restart the app.
es: Fallo al inicializar Firebase. Por favor, reinicia la aplicación.

# splashWelcome
source: WELCOME TO HARKAI
es: BIENVENIDO A HARKAI

# registerTitle
source: REGISTER
es: REGISTRARSE

# usernameHint
source: Username
es: Nombre de usuario

# emailHint
source: Email
es: Correo electrónico

# passwordHint
source: Password
es: Contraseña

# signUpButton
source: SIGN UP
es: REGISTRARSE

# signUpWithGoogleButton
source: Sign up with Google
es: Registrarse con Google

# alreadyHaveAccountPrompt
source: Already have an account?
es: ¿Ya tienes una cuenta?

# logInLink
source: LOG IN
es: INICIAR SESIÓN

# googleSignInSuccess
source: Google Sign-In successful!
es: ¡Inicio de sesión con Google exitoso!

# googleSignInErrorPrefix
source: Failed to sign in with Google:
es: Error al iniciar sesión con Google:

# emailSignupSuccess
source: Signup successful!
es: ¡Registro exitoso!

# emailSignupErrorPrefix
source: Failed to sign up:
es: Error al registrarse:

# profileTitle
source: User Profile
es: Perfil de Usuario

# profileDefaultUsername
source: User
es: Usuario

# profileEmailLabel
source: Email
es: Correo Electrónico

# profileValueNotAvailable
source: N/A
es: No disponible

# profilePasswordLabel
source: Password
es: Contraseña

# profilePasswordHiddenText
source: password hidden
es: contraseña oculta

# profileChangePasswordButton
source: Change Password
es: Cambiar Contraseña

# profileBlockCardsButton
source: Block Cards
es: Bloquear Tarjetas

# profileLogoutButton
source: Logout
es: Cerrar Sesión

# profileDialerErrorPrefix
source: Error launching dialer:
es: Error al abrir el marcador:

# profilePhonePermissionDenied
source: Permission denied to make calls
es: Permiso denegado para realizar llamadas

# profileResetPasswordDialogTitle
source: Reset Password
es: Restablecer Contraseña

# profileResetPasswordDialogContent
source: Are you sure you want to reset your password?
es: ¿Estás seguro de que quieres restablecer tu contraseña?

# profileDialogYes
source: Yes
es: Sí

# profilePasswordResetEmailSent
source: Password reset email sent!
es: ¡Correo de restablecimiento de contraseña enviado!

# profileNoEmailForPasswordReset
source: No email found for password reset!
es: ¡No se encontró correo para restablecer la contraseña!

# loginTitle
source: LOGIN
es: INICIAR SESIÓN

# loginForgotPasswordLink
source: Forgot Password?
es: ¿Olvidaste tu contraseña?

# loginSignInButton
source: SIGN IN
es: INICIAR SESIÓN

# loginSignInWithGoogleButton
source: Sign in with Google
es: Iniciar sesión con Google

# loginDontHaveAccountPrompt
source: Don't have an account?
es: ¿No tienes una cuenta?

# loginForgotPasswordDialogTitle
source: Forgot Password
es: Olvidé mi Contraseña

# loginForgotPasswordDialogContent
source: Enter your email to receive a password reset link:
es: Ingresa tu correo electrónico para recibir un enlace de restablecimiento de contraseña:

# loginSendButton
source: SEND
es: ENVIAR

# loginPasswordResetEmailSent
source: Password reset email sent.
es: Correo de restablecimiento de contraseña enviado.

# loginEmptyFieldsPrompt
source: Please enter your email and password.
es: Por favor, ingresa tu correo electrónico y contraseña.

# loginFailedErrorPrefix
source: Login failed:
es: Falló el inicio de sesión:

# chatApiKeyNotConfigured
source: API Key for Harki AI is not configured. Please check your .env file.
es: La clave API para Harki AI no está configurada. Por favor, revisa tu archivo .env.

# chatHarkiAiInitializedSuccess
source: Harki AI Initialized.
es: Harki AI Inicializado.

# chatHarkiAiInitFailedPrefix
source: Failed to initialize Harki AI. Check API Key and network. Error:
es: Fallo al inicializar Harki AI. Revisa la clave API y la red. Error:

# chatHarkiAiNotInitializedOnSend
source: Harki AI is not initialized. Please wait or check API key & network.
es: Harki AI no está inicializado. Por favor espera o revisa la clave API y la red.

# chatSessionNotStartedOnSend
source: Chat session not started. Please try re-initializing.
es: La sesión de chat no ha comenzado. Por favor, intenta reinicializar.

# chatHarkiAiEmptyResponse
source: Harki AI returned an empty response.
es: Harki AI devolvió una respuesta vacía.

# chatHarkiAiEmptyResponseFallbackMessage
source: Sorry, I didn't get a response. Please try again.
es: Lo siento, no obtuve una respuesta. Por favor, inténtalo de nuevo.

# chatSendMessageFailedPrefix
source: Failed to send message to Harki AI. Error:
es: Fallo al enviar el mensaje a Harki AI. Error:

# chatSendMessageErrorFallbackMessage
source: Error: Could not get a response from Harki.
es: Error: No se pudo obtener una respuesta de Harki.

# chatScreenTitle
source: Harki AI Chat
es: Chat con Harki AI

# chatInitializingHarkiAiText
source: Initializing Harki AI...
es: Inicializando Harki AI...

# chatHarkiIsTypingText
source: Harki is typing...
es: Harki está escribiendo...

# chatMessageHintReady
source: Message Harki...
es: Mensaje a Harki...

# chatMessageHintInitializing
source: Harki AI is initializing...
es: Harki AI se está inicializando...

# chatSenderNameUserFallback
source: You
es: Tú

# homeScreenLocationInfoText
source: This is happening in your area
es: Esto está sucediendo en tu área

# homeMapLoadingText
source: Loading map data...
es: Cargando datos del mapa...

# homeFireAlertButtonTitle
source: Fires
es: Incendios

# homeCrashAlertButtonTitle
source: Crashes
es: Choques

# homeTheftAlertButtonTitle
source: Thefts
es: Robos

# homePetAlertButtonTitle
source: Pets
es: Mascotas

# homeCallAgentButton
source: Call {agent}
es: {agent}

# homeCallEmergenciesButton
source: Call Emergencies
es: Emergencias

# agentFirefighters
source: Firefighters
es: Bomberos

# agentPolice
source: Police
es: Policía

# agentShelter
source: Shelter
es: Refugio

# agentEmergencies
source: Emergencies
es: Emergencias

# mapLoadingLocation
source: Loading location...
es: Cargando ubicación...

# mapFetchingLocation
source: Fetching location...
es: Obteniendo ubicación...

# mapYouAreIn
source: You are in {location}
es: Estás en {location}

# mapinitialFetchingLocation
source: Initial location fetching...
es: Obteniendo ubicación inicial...

# mapCouldNotFetchAddress
source: Could not fetch address
es: No se pudo obtener la dirección

# mapFailedToGetInitialLocation
source: Failed to get initial location
es: Error al obtener la ubicación inicial

# mapLocationServicesDisabled
source: Location services are disabled.
es: Servicios de ubicación desactivados.

# mapLocationPermissionDenied
source: Location permission denied.
es: Permiso de ubicación denegado.

# mapErrorFetchingLocation
source: Error fetching location: {error}
es: Error al obtener la ubicación: {error}

# mapCurrentUserLocationNotAvailable
source: Current user location not available.
es: Ubicación actual del usuario no disponible.

# incidentReportedSuccess
source: {incidentTitle} incident reported!
es: ¡Incidente de {incidentTitle} reportado!

# incidentReportFailed
source: Failed to report {incidentTitle} incident.
es: Error al reportar incidente de {incidentTitle}.

# targetLocationNotSet
source: Target location not set. Tap on map or use compass.
es: Ubicación objetivo no establecida. Toca en el mapa o usa la brújula.

# emergencyReportLocationUnknown
source: Unable to report emergency: Target location unknown.
es: No se puede reportar emergencia: Ubicación objetivo desconocida.

# enlargedMapDataUnavailable
source: Map data is currently unavailable. Please try again.
es: Datos del mapa no disponibles actualmente. Por favor, inténtalo de nuevo.

# incidentModalStep1ReportAudioTitle
source: Record Audio for {incidentName}
es: Dinos lo que paso {incidentName}

# incidentModalStatusInitializing
source: Initializing...
es: Inicializando...

# incidentModalStatusRecordingAudio
source: Recording Audio...
es: Grabando Audio...

# incidentModalStatusAudioRecorded
source: Audio Recorded!
es: ¡Audio Grabado!

# incidentModalStatusSendingAudioToHarki
source: Harki Analyzing Description...
es: Harki Analizando Descripción...

# incidentModalStatusConfirmAudioDescription
source: Confirm Description:
es: Confirmar Descripción:

# incidentModalStatusStep2AddImage
source: Add Image (Optional)
es: Añadir Imagen (Opcional)

# incidentModalStatusCapturingImage
source: Capturing Image...
es: Capturando Imagen...

# incidentModalStatusImagePreview
source: Image Preview
es: Vista Previa de Imagen

# incidentModalStatusSendingImageToHarki
source: Harki Analyzing Image...
es: Harki Analizando Imagen...

# incidentModalStatusImageAnalyzed
source: Image Analyzed
es: Imagen Analizada

# incidentModalStatusSubmittingIncident
source: Submitting Incident...
es: Enviando Incidente...

# incidentModalStatusTypeMismatch
source: Type Mismatch
es: Tipo no Coincide

# incidentModalStatusInputUnclearInvalid
source: Input Unclear/Invalid
es: Entrada No Clara/Inválida

# incidentModalStatusHarkiProcessingError
source: Harki Processing Error
es: Error de Procesamiento de Harki

# incidentModalInstructionHoldMic
source: Hold Mic to record audio description.
es: Mantén presionado el Mic para grabar la descripción de audio.

# incidentModalInstructionMicPermissionNeeded
source: Mic permission needed. Tap Mic to check/grant or grant in settings.
es: Se necesita permiso de micrófono. Toca el Mic para verificar/otorgar o concédelo en la configuración.

# incidentModalInstructionHarkiInitializing
source: Harki AI is initializing. Please wait or tap Mic to retry.
es: Harki AI se está inicializando. Espera o toca el Mic para reintentar.

# incidentModalInstructionMicPermAndHarkiInit
source: Mic permission needed & Harki AI initializing. Tap Mic to proceed.
es: Se necesita permiso de Mic y Harki AI se está inicializando. Toca el Mic para continuar.

# incidentModalInstructionReleaseMic
source: Release Mic to stop.
es: Suelta el Mic para detener.

# incidentModalInstructionSendAudioToHarki
source: Tap "Send Audio to Harki" for analysis.
es: Toca "Enviar Audio a Harki" para analizar.

# incidentModalInstructionPleaseWait
source: Please wait.
es: Por favor espera.

# incidentModalInstructionConfirmAudio
source: Harki suggests: "{audioDescription}". Is this correct?
es: Harki sugiere: "{audioDescription}". ¿Es correcto?

# incidentModalInstructionAddImageOrSubmit
source: Confirmed Audio: "{confirmedAudioDescription}" Add an image or submit with description only.
es: Audio Confirmado: "{confirmedAudioDescription}" Añade una imagen o envía solo con descripcion.

# incidentModalInstructionUseCamera
source: Please use the camera to capture an image.
es: Usa la cámara para capturar una imagen.

# incidentModalInstructionAnalyzeRetakeRemoveImage
source: Analyze this image with Harki, retake it, or remove it to proceed with audio only.
es: Analiza esta imagen con Harki, tómala de nuevo o elimínala para continuar solo con audio.

# incidentModalInstructionImageApproved
source: Image approved by Harki! Submit with current details, retake image, or remove image.
es: ¡Imagen aprobada por Harki! Envía con los detalles actuales, toma la imagen de nuevo o elimínala.

# incidentModalInstructionImageFeedback
source: Image Feedback from Harki: {imageFeedback} Submit with current details, retake image, or remove image.
es: Comentarios de Harki sobre la imagen: {imageFeedback} Envía con los detalles actuales, toma la imagen de nuevo o elimínala.

# incidentModalInstructionUploadingMedia
source: Uploading media, please wait.
es: Subiendo multimedia, por favor espera.

# incidentModalErrorMicPermissionRequired
source: Microphone permission is required for audio recording. Please grant it in settings or restart the report process.
es: Se requiere permiso de micrófono para grabar audio. Otórgalo en la configuración o reinicia el proceso de reporte.

# incidentModalErrorFailedToInitHarki
source: Failed to initialize Harki AI. Media processing unavailable.
es: Error al inicializar Harki AI. Procesamiento de multimedia no disponible.

# incidentModalErrorMicNotGranted
source: Microphone permission not granted. Cannot record audio.
es: Permiso de micrófono no otorgado. No se puede grabar audio.

# incidentModalErrorHarkiNotReadyAudio
source: Harki AI is not ready. Cannot process audio.
es: Harki AI no está listo. No se puede procesar audio.

# incidentModalErrorCouldNotStartRecording
source: Could not start recording. Please ensure microphone is available.
es: No se pudo iniciar la grabación. Asegúrate de que el micrófono esté disponible.

# incidentModalErrorAudioEmptyNotSaved
source: Audio recording seems empty or was not saved correctly. Please try again.
es: La grabación de audio parece vacía o no se guardó correctamente. Inténtalo de nuevo.

# incidentModalErrorNoAudioOrHarkiNotReady
source: No audio recorded or Harki AI not ready.
es: No hay audio grabado o Harki AI no está listo.

# incidentModalErrorHarkiAudioResponseFormatUnexpected
source: Harki AI audio response format was unexpected: {responseText}. Please review or retry.
es: El formato de respuesta de audio de Harki AI fue inesperado: {responseText}. Revisa o reintenta.

# incidentModalErrorHarkiNoActionableTextAudio
source: Harki AI returned no actionable text for audio.
es: Harki AI no devolvió texto procesable para el audio.

# incidentModalErrorHarkiAudioProcessingFailed
source: Harki AI audio processing failed: {error}
es: El procesamiento de audio de Harki AI falló: {error}

# incidentModalErrorNoAudioToConfirm
source: No audio description to confirm.
es: No hay descripción de audio para confirmar.

# incidentModalErrorHarkiNotReadyImage
source: Harki AI is not ready. Cannot process image.
es: Harki AI no está listo. No se puede procesar la imagen.

# incidentModalErrorNoImageOrHarkiNotReady
source: No image captured or Harki AI not ready.
es: No hay imagen capturada o Harki AI no está listo.

# incidentModalErrorHarkiNoActionableTextImage
source: Harki AI returned no actionable text for image.
es: Harki AI no devolvió texto procesable para la imagen.

# incidentModalErrorHarkiImageProcessingFailed
source: Harki AI image processing failed: {error}
es: El procesamiento de imagen de Harki AI falló: {error}

# incidentModalErrorUserNotLoggedIn
source: User not logged in. Cannot submit incident.
es: Usuario no ha iniciado sesión. No se puede enviar el incidente.

# incidentModalErrorFailedToUploadImage
source: Failed to upload image. Please try again or submit without image.
es: Error al subir la imagen. Inténtalo de nuevo o envía sin imagen.

# incidentModalErrorNoConfirmedAudioDescription
source: No confirmed audio description available. Please complete audio step first.
es: No hay descripción de audio confirmada disponible. Completa primero el paso de audio.

# incidentModalButtonHoldToRecordReleaseToStop
source: Hold to record, release to stop.
es: Mantén presionado para grabar, suelta para detener.

# incidentModalButtonSendAudioToHarki
source: Send Audio to Harki
es: Enviar Audio a Harki

# incidentModalButtonConfirmAudioAndProceed
source: Confirm & Proceed
es: Confirmar y Continuar

# incidentModalButtonRerecordAudio
source: Re-record Audio
es: Grabar Audio de Nuevo

# incidentModalButtonSubmitWithAudioOnly
source: Submit with Description Only
es: Enviar solo con detalle

# incidentModalButtonAddPicture
source: Add Picture
es: Añadir Foto

# incidentModalButtonRetakePicture
source: Retake Picture
es: Tomar Foto de Nuevo

# incidentModalButtonAnalyzeImageWithHarki
source: Analyze Image with Harki
es: Analizar Imagen con Harki

# incidentModalButtonUseAudioOnlyRemoveImage
source: Use Audio Only (Remove Image)
es: Usar Solo Audio (Eliminar Imagen)

# incidentModalButtonSubmitWithAudioAndImage
source: Submit with Audio & Image
es: Enviar con Audio e Imagen

# incidentModalButtonSubmitAudioOnlyInstead
source: Submit Audio Only Instead
es: Enviar Solo Audio en su Lugar

# incidentModalButtonTryAgainFromStart
source: Try Again from Start
es: Intentar de Nuevo desde el Inicio

# incidentModalButtonCancelReport
source: Cancel Report
es: Cancelar Reporte

# incidentModalImageForIncident
source: Image for Incident:
es: Imagen para el Incidente:

# incidentModalImageRemoveTooltip
source: Remove Image
es: Eliminar Imagen

# incidentModalImageHarkiLooksGood
source: Harki: Image looks good!
es: Harki: ¡La imagen se ve bien!

# incidentModalImageHarkiAnalysisComplete
source: Harki: Analysis complete.
es: Harki: Análisis completo.

# incidentModalAudioConfirmedAudio
source: Confirmed Audio:
es: Audio Confirmado:

# incidentImageModalDescriptionLabel
source: Description:
es: Descripción:

# incidentImageModalNoImage
source: No image for this incident.
es: No hay imagen para este incidente.

# incidentImageModalNoAdditionalDescription
source: No additional description provided for the image.
es: No se proporcionó descripción adicional para la imagen.

# incidentImageModalCloseButton
source: Close
es: Cerrar

# incidentImageModalImageUnavailable
source: Image unavailable
es: Imagen no disponible

# locationServiceDisabled
source: Location services are disabled.
es: Servicios de ubicación desactivados.

# locationServicePermissionDenied
source: Location permission denied.
es: Permiso de ubicación denegado.

# locationServicePermissionPermanentlyDenied
source: Location permissions are permanently denied. Please enable them in app settings.
es: Los permisos de ubicación están denegados permanentemente. Habilítalos en la configuración de la aplicación.

# locationServiceFailedToGetLocation
source: Failed to get location: {error}
es: Error al obtener la ubicación: {error}

# locationServiceGeocodingApiError
source: Error from Geocoding API: {status} - {errorMessage}
es: Error de la API de Geocodificación: {status} - {errorMessage}

# locationServiceGeocodingFailedDefault
source: Failed to fetch address (API status not OK)
es: Error al obtener la dirección (estado de API no OK)

# locationServiceGeocodingNoResults
source: No address results found for the given coordinates.
es: No se encontraron resultados de dirección para las coordenadas dadas.

# locationServiceGeocodingLocationLatLonNoAddress
source: Location: {latitude}, {longitude} (No address found)
es: Ubicación: {latitude}, {longitude} (No se encontró dirección)

# locationServiceGeocodingLocationLatLonComponentsNotFound
source: Location: {latitude}, {longitude} (Address components not found)
es: Ubicación: {latitude}, {longitude} (Componentes de dirección no encontrados)

# locationServiceGeocodingErrorGeneric
source: Geocoding error: {error}
es: Error de geocodificación: {error}

# phoneServicePermissionDenied
source: Permission denied to make calls. Please enable it in settings.
es: Permiso denegado para hacer llamadas. Habilítalo en la configuración.

# phoneServiceCouldNotLaunchDialer
source: Could not launch dialer: {error}
es: No se pudo iniciar el marcador: {error}

# incidentScreenTitle
source: {incidentType} Near You
es: {incidentType} cerca a ti

# incidentFeedNoIncidentsFound
source: No {incidentType} incidents found nearby at the moment.
es: No se encontraron incidentes de {incidentType} cercanos por el momento.

# incidentTileDefaultTitle
source: Incident Reported
es: Incidente Reportado

# incidentTileDistanceMeters
source: {distance}m away
es: A {distance}m

# incidentTileDistanceKm
source: {distance}km away
es: A {distance}km

# incidentMapViewTitle
source: Location of {incidentType}
es: Ubicación de {incidentType}

# incidentMapViewIncidentExpired
source: This incident report has expired or is no longer visible.
es: Este reporte de incidente ha expirado o ya no está visible.

# placesScreenTitle
source: Places
es: Lugares

# addPlaceButtonTitle
source: Place
es: Lugares de Interés

# placeMarkerName
source: Place
es: Lugar

# paymentRequiredMessage
source: A ${amount} payment is required to add this place.
es: Se requiere un pago de {amount} para añadir este lugar.

# paymentProcessingMessage
source: Processing payment...
es: Procesando pago...

# paymentSuccessfulMessage
source: Payment successful! Place added.
es: ¡Pago exitoso! Lugar añadido.

# paymentFailedMessage
source: Payment failed. Please try again.
es: El pago falló. Por favor, inténtalo de nuevo.

# photoRequiredMessage
source: A photo is mandatory to add a place.
es: Una foto es obligatoria para añadir un lugar.

# placesIncidentFeedTitle
source: Nearby Places
es: Lugares Cercanos

# buttonAddPlace
source: Add Place
es: Añadir Lugar

# hintSearch
source: Search by description...
es: Busca por descripcion...

# searchNoResults
source: No description match your search
es: Ninguna descripcion encontrada.

# mapMarkerTooFar
source: The marker is too far from your current location.
es: El marcador está demasiado lejos de tu ubicación actual.

# onboardingWelcomeTitle
source: Welcome to Harkai!
es: ¡Bienvenido a Harkai!

# onboardingWelcomeDescription
source: Meet Harki, your personal AI assistant. Harki can help you with safety tips and guide you through the app's features.
es: Conoce a Harki, tu asistente personal de IA. Harki puede ayudarte con consejos de seguridad y guiarte a través de las funciones de la aplicación.

# onboardingIncidentsTitle
source: Reporting Incidents
es: Reportando Incidentes

# onboardingIncidentsDescription
source: Tap an incident button (like 'Fire' or 'Theft') to report something at a specific location. Long-press the button to see a feed of recent, nearby incidents of that type.
es: Toca un botón de incidente (como 'Incendio' o 'Robo') para reportar algo en una ubicación específica. Mantén presionado el botón para ver una lista de incidentes recientes y cercanos de ese tipo.

# onboardingMapTitle
source: Pinpointing Locations
es: Ubicaciones Precisas

# onboardingMapDescription
source: To report an incident, first tap on the map to place the target marker precisely where the event is happening. You can also tap the compass icon to center it on your current location.
es: Para reportar un incidente, primero toca en el mapa para colocar el marcador de objetivo precisamente donde está ocurriendo el evento. También puedes tocar el ícono de la brújula para centrarlo en tu ubicación actual.

# onboardingGotIt
source: Got it!
es: ¡Entendido!

# onboardingNext
source: Next
es: Siguiente

# authWeakPassword
source: The password provided is too weak.
es: La contraseña proporcionada es demasiado débil.

# authEmailInUse
source: The account already exists for that email.
es: La cuenta ya existe para ese correo electrónico.

# authInvalidEmail
source: The email address is not valid.
es: La dirección de correo electrónico no es válida.

# authGenericError
source: An error occurred. Please try again.
es: Ocurrió un error. Por favor, inténtalo de nuevo.

# authUserNotFound
source: No user found for that email.
es: No se encontró ningún usuario para ese correo electrónico.

# authWrongPassword
source: Wrong password provided for that user.
es: Contraseña incorrecta proporcionada para ese usuario.

# authSignOutError
source: Error signing out. Please try again.
es: Error al cerrar la sesión. Por favor, inténtalo de nuevo.

# profileLogoutMessage
source: The user has been logged out successfully.
es: Se ha cerrado la sesión correctamente.

# notifFireNearbyTitle
source: Fire Nearby
es: Incendio Cercano

# notifFireNearbyBody
source: Warning, there is a fire nearby. Please be cautious.
es: Advertencia, hay un incendio cerca. Por favor, ten cuidado.

# notifFireDangerTitle
source: Danger: Fire Ahead
es: Peligro: Incendio Adelante

# notifFireDangerBody
source: You are getting very close to the fire. Avoid the area for your safety.
es: Te estás acercando mucho al incendio. Evita la zona por tu seguridad.
